remove_design -designs
set search_path {/home/marupust/Desktop/research_benchmark/nikhil_bhaiya_files/technology_files}
set target_library {saed90nm_typ_ht.db}
set link_library {saed90nm_typ_ht.db}
set symbol_library {saed90nm.sdb}
set asynch 1;
set design {test}
#set_dont_use saed90nm_typ_ht/AND2X1
#set_dont_use saed90nm_typ_ht/AND2X2
#set_dont_use saed90nm_typ_ht/AND2X4
set_dont_use saed90nm_typ_ht/AND3X1
set_dont_use saed90nm_typ_ht/AND3X2
set_dont_use saed90nm_typ_ht/AND3X4
set_dont_use saed90nm_typ_ht/AND4X1
set_dont_use saed90nm_typ_ht/AND4X2
set_dont_use saed90nm_typ_ht/AND4X4
set_dont_use saed90nm_typ_ht/ANTENNA
set_dont_use saed90nm_typ_ht/AO21X1
set_dont_use saed90nm_typ_ht/AO21X2
set_dont_use saed90nm_typ_ht/AO22X1
set_dont_use saed90nm_typ_ht/AO22X2
set_dont_use saed90nm_typ_ht/AO221X1
set_dont_use saed90nm_typ_ht/AO221X2
set_dont_use saed90nm_typ_ht/AO222X1
set_dont_use saed90nm_typ_ht/AO222X2
set_dont_use saed90nm_typ_ht/AOBUFX1
set_dont_use saed90nm_typ_ht/AOBUFX2
set_dont_use saed90nm_typ_ht/AOBUFX4
set_dont_use saed90nm_typ_ht/AODFFARX1
set_dont_use saed90nm_typ_ht/AODFFARX2
set_dont_use saed90nm_typ_ht/AODFFNARX1
set_dont_use saed90nm_typ_ht/AODFFNARX2
set_dont_use saed90nm_typ_ht/AOI21X1
set_dont_use saed90nm_typ_ht/AOI21X2
set_dont_use saed90nm_typ_ht/AOI22X1
set_dont_use saed90nm_typ_ht/AOI22X2
set_dont_use saed90nm_typ_ht/AOI221X1
set_dont_use saed90nm_typ_ht/AOI221X2
set_dont_use saed90nm_typ_ht/AOI222X1
set_dont_use saed90nm_typ_ht/AOI222X2
set_dont_use saed90nm_typ_ht/AOINVX1
set_dont_use saed90nm_typ_ht/AOINVX2
set_dont_use saed90nm_typ_ht/AOINVX4
set_dont_use saed90nm_typ_ht/BSLEX1
set_dont_use saed90nm_typ_ht/BSLEX2
set_dont_use saed90nm_typ_ht/BSLEX4
set_dont_use saed90nm_typ_ht/BUSKP
set_dont_use saed90nm_typ_ht/CLOAD1
set_dont_use saed90nm_typ_ht/DCAP
set_dont_use saed90nm_typ_ht/DEC24X1
set_dont_use saed90nm_typ_ht/DEC24X2
set_dont_use saed90nm_typ_ht/DELLN1X2
set_dont_use saed90nm_typ_ht/DELLN2X2
set_dont_use saed90nm_typ_ht/DELLN3X2
#set_dont_use saed90nm_typ_ht/DFFARX1
set_dont_use saed90nm_typ_ht/DFFARX2
set_dont_use saed90nm_typ_ht/DFFASRX1
set_dont_use saed90nm_typ_ht/DFFASRX2
set_dont_use saed90nm_typ_ht/DFFASX1
set_dont_use saed90nm_typ_ht/DFFASX2
set_dont_use saed90nm_typ_ht/DFFNARX1
set_dont_use saed90nm_typ_ht/DFFNARX2
set_dont_use saed90nm_typ_ht/DFFNASRNX1
set_dont_use saed90nm_typ_ht/DFFNASRNX2
set_dont_use saed90nm_typ_ht/DFFNASRQX1
set_dont_use saed90nm_typ_ht/DFFNASRQX2
set_dont_use saed90nm_typ_ht/DFFNASRX1
set_dont_use saed90nm_typ_ht/DFFNASRX2
set_dont_use saed90nm_typ_ht/DFFNASX1
set_dont_use saed90nm_typ_ht/DFFNASX2
set_dont_use saed90nm_typ_ht/DFFNX1
set_dont_use saed90nm_typ_ht/DFFNX2
set_dont_use saed90nm_typ_ht/DFFX1
set_dont_use saed90nm_typ_ht/DFFX2
set_dont_use saed90nm_typ_ht/DFFSSRX1
set_dont_use saed90nm_typ_ht/DFFSSRX2
set_dont_use saed90nm_typ_ht/DHFILLHLH2
set_dont_use saed90nm_typ_ht/DHFILLHLHLS11
set_dont_use saed90nm_typ_ht/DHFILLLHL2
set_dont_use saed90nm_typ_ht/FADDX1
set_dont_use saed90nm_typ_ht/FADDX2
set_dont_use saed90nm_typ_ht/HADDX1
set_dont_use saed90nm_typ_ht/HADDX2
set_dont_use saed90nm_typ_ht/HEAD2X2
set_dont_use saed90nm_typ_ht/HEAD2X4
set_dont_use saed90nm_typ_ht/HEAD2X8
set_dont_use saed90nm_typ_ht/HEAD2X16
set_dont_use saed90nm_typ_ht/HEAD2X32
set_dont_use saed90nm_typ_ht/HEADX2
set_dont_use saed90nm_typ_ht/HEADX4
set_dont_use saed90nm_typ_ht/HEADX8
set_dont_use saed90nm_typ_ht/HEADX16
set_dont_use saed90nm_typ_ht/HEADX32
#set_dont_use saed90nm_typ_ht/INVX0
#set_dont_use saed90nm_typ_ht/INVX1
#set_dont_use saed90nm_typ_ht/INVX2
#set_dont_use saed90nm_typ_ht/INVX4
#set_dont_use saed90nm_typ_ht/INVX8
#set_dont_use saed90nm_typ_ht/INVX16
#set_dont_use saed90nm_typ_ht/INVX32
set_dont_use saed90nm_typ_ht/IBUFFX2
set_dont_use saed90nm_typ_ht/IBUFFX4
set_dont_use saed90nm_typ_ht/IBUFFX8
set_dont_use saed90nm_typ_ht/IBUFFX16
set_dont_use saed90nm_typ_ht/IBUFFX32
set_dont_use saed90nm_typ_ht/ISOLANDX1
set_dont_use saed90nm_typ_ht/ISOLANDX2
set_dont_use saed90nm_typ_ht/ISOLANDX4
set_dont_use saed90nm_typ_ht/ISOLANDX8
set_dont_use saed90nm_typ_ht/ISOLORX1
set_dont_use saed90nm_typ_ht/ISOLORX2
set_dont_use saed90nm_typ_ht/ISOLORX4
set_dont_use saed90nm_typ_ht/ISOLORX8
set_dont_use saed90nm_typ_ht/LARX1
set_dont_use saed90nm_typ_ht/LARX2
set_dont_use saed90nm_typ_ht/LASRNX1
set_dont_use saed90nm_typ_ht/LASRNX2
set_dont_use saed90nm_typ_ht/LASRQX1
set_dont_use saed90nm_typ_ht/LASRQX2
set_dont_use saed90nm_typ_ht/LASRX1
set_dont_use saed90nm_typ_ht/LASRX2
set_dont_use saed90nm_typ_ht/LASX1
set_dont_use saed90nm_typ_ht/LASX2
set_dont_use saed90nm_typ_ht/LATCHX1
set_dont_use saed90nm_typ_ht/LATCHX2
set_dont_use saed90nm_typ_ht/LNANDX1
set_dont_use saed90nm_typ_ht/LNANDX2
set_dont_use saed90nm_typ_ht/MUX21X1
set_dont_use saed90nm_typ_ht/MUX21X2
set_dont_use saed90nm_typ_ht/MUX41X1
set_dont_use saed90nm_typ_ht/MUX41X2
#set_dont_use saed90nm_typ_ht/NAND2X0
#set_dont_use saed90nm_typ_ht/NAND2X1
#set_dont_use saed90nm_typ_ht/NAND2X2
#set_dont_use saed90nm_typ_ht/NAND2X4
set_dont_use saed90nm_typ_ht/NAND3X0
set_dont_use saed90nm_typ_ht/NAND3X1
set_dont_use saed90nm_typ_ht/NAND3X2
set_dont_use saed90nm_typ_ht/NAND3X4
set_dont_use saed90nm_typ_ht/NAND4X0
set_dont_use saed90nm_typ_ht/NAND4X1
set_dont_use saed90nm_typ_ht/NBUFFX2
set_dont_use saed90nm_typ_ht/NBUFFX4
set_dont_use saed90nm_typ_ht/NBUFFX8
set_dont_use saed90nm_typ_ht/NBUFFX16
set_dont_use saed90nm_typ_ht/NBUFFX32
set_dont_use saed90nm_typ_ht/NMT1
set_dont_use saed90nm_typ_ht/NMT2
set_dont_use saed90nm_typ_ht/NMT3
#set_dont_use saed90nm_typ_ht/NOR2X0
#set_dont_use saed90nm_typ_ht/NOR2X1
#set_dont_use saed90nm_typ_ht/NOR2X2
#set_dont_use saed90nm_typ_ht/NOR2X4
set_dont_use saed90nm_typ_ht/NOR3X0
set_dont_use saed90nm_typ_ht/NOR3X1
set_dont_use saed90nm_typ_ht/NOR3X2
set_dont_use saed90nm_typ_ht/NOR3X4
set_dont_use saed90nm_typ_ht/NOR4X0
set_dont_use saed90nm_typ_ht/NOR4X1
set_dont_use saed90nm_typ_ht/OA21X1
set_dont_use saed90nm_typ_ht/OA21X2
set_dont_use saed90nm_typ_ht/OA22X1
set_dont_use saed90nm_typ_ht/OA22X2
set_dont_use saed90nm_typ_ht/OA221X1
set_dont_use saed90nm_typ_ht/OA221X2
set_dont_use saed90nm_typ_ht/OA222X1
set_dont_use saed90nm_typ_ht/OA222X2
set_dont_use saed90nm_typ_ht/OAI21X1
set_dont_use saed90nm_typ_ht/OAI21X2
set_dont_use saed90nm_typ_ht/OAI22X1
set_dont_use saed90nm_typ_ht/OAI22X2
set_dont_use saed90nm_typ_ht/OAI221X1
set_dont_use saed90nm_typ_ht/OAI221X2
set_dont_use saed90nm_typ_ht/OAI222X1
set_dont_use saed90nm_typ_ht/OAI222X2
#set_dont_use saed90nm_typ_ht/OR2X1
#set_dont_use saed90nm_typ_ht/OR2X2
#set_dont_use saed90nm_typ_ht/OR2X4
set_dont_use saed90nm_typ_ht/OR3X1
set_dont_use saed90nm_typ_ht/OR3X2
set_dont_use saed90nm_typ_ht/OR3X4
set_dont_use saed90nm_typ_ht/OR4X1
set_dont_use saed90nm_typ_ht/OR4X2
set_dont_use saed90nm_typ_ht/OR4X4
set_dont_use saed90nm_typ_ht/PGX1
set_dont_use saed90nm_typ_ht/PGX2
set_dont_use saed90nm_typ_ht/PGX4
set_dont_use saed90nm_typ_ht/PMT1
set_dont_use saed90nm_typ_ht/PMT2
set_dont_use saed90nm_typ_ht/PMT3
set_dont_use saed90nm_typ_ht/SDFFARX1
set_dont_use saed90nm_typ_ht/SDFFARX2
set_dont_use saed90nm_typ_ht/SDFFASRSX1
set_dont_use saed90nm_typ_ht/SDFFASRSX2
set_dont_use saed90nm_typ_ht/SDFFASRX1
set_dont_use saed90nm_typ_ht/SDFFASRX2
set_dont_use saed90nm_typ_ht/SDFFASX1
set_dont_use saed90nm_typ_ht/SDFFASX2
set_dont_use saed90nm_typ_ht/SDFFNARX1
set_dont_use saed90nm_typ_ht/SDFFNARX2
set_dont_use saed90nm_typ_ht/SDFFNASRX1
set_dont_use saed90nm_typ_ht/SDFFNASRX2
set_dont_use saed90nm_typ_ht/SDFFNASX1
set_dont_use saed90nm_typ_ht/SDFFNASX2
set_dont_use saed90nm_typ_ht/SDFFNX1
set_dont_use saed90nm_typ_ht/SDFFNX2
set_dont_use saed90nm_typ_ht/SDFFSSRX1
set_dont_use saed90nm_typ_ht/SDFFSSRX2
set_dont_use saed90nm_typ_ht/SDFFX1
set_dont_use saed90nm_typ_ht/SDFFX2
set_dont_use saed90nm_typ_ht/SHFILL1
set_dont_use saed90nm_typ_ht/SHFILL2
set_dont_use saed90nm_typ_ht/SHFILL3
set_dont_use saed90nm_typ_ht/SHFILL64
set_dont_use saed90nm_typ_ht/SHFILL128
set_dont_use saed90nm_typ_ht/TIEH
set_dont_use saed90nm_typ_ht/TIEL
set_dont_use saed90nm_typ_ht/TNBUFFX1
set_dont_use saed90nm_typ_ht/TNBUFFX2
set_dont_use saed90nm_typ_ht/TNBUFFX4
set_dont_use saed90nm_typ_ht/TNBUFFX8
set_dont_use saed90nm_typ_ht/TNBUFFX16
set_dont_use saed90nm_typ_ht/TNBUFFX32
#set_dont_use saed90nm_typ_ht/XNOR2X1
#set_dont_use saed90nm_typ_ht/XNOR2X2
#set_dont_use saed90nm_typ_ht/XOR2X1
#set_dont_use saed90nm_typ_ht/XOR2X2
set_dont_use saed90nm_typ_ht/XNOR3X1
set_dont_use saed90nm_typ_ht/XNOR3X2
set_dont_use saed90nm_typ_ht/XOR3X1
set_dont_use saed90nm_typ_ht/XOR3X2

analyze -library WORK -format verilog {/home/marupust/Desktop/AGG_ANTLR_AMAR/Attributed_graph_Grammar/Antlr/AGL/pattern_merge_graphs/pattern_1_0.v}
elaborate test_final -architecture verilog -library DEFAULT
link
uniquify
compile -map_effort high
write -hierarchy -format verilog -output {/home/marupust/Desktop/AGG_ANTLR_AMAR/Attributed_graph_Grammar/Antlr/AGL/pattern_merge_graphs/dc_pattern_1_0.v}
exit